{
  "story": {
    "title": "Calculating 4!",
    "backgroundSetup": "The Factorial Factory is a vertical, whimsical building where each floor represents a level of recursion in calculating factorials. The factory has four main levels (4, 3, 2, and 1), connected by colorful speaking tubes that allow managers to communicate between floors. Each level has its own personality, with oversized gears, multiplication machines, and glowing numbers. The architecture is playfully impossible—staircases that spiral in impossible directions, conveyor belts that defy gravity, and walls covered in glowing mathematical equations. The color palette features jewel tones (ruby red for Level 4, emerald green for Level 3, sapphire blue for Level 2, and golden for Level 1) with cheerful lighting and floating number sprites. Everything has a hand-painted, storybook quality with visible brushstrokes and whimsical details. The factory demonstrates how recursion works: each level receives a problem, delegates part of it downward, waits for the answer to come back up, and then completes its own calculation."
  },
  "characters": [
    {
      "name": "Manager Four",
      "description": "A tall, enthusiastic character wearing a hard hat shaped like the number \"4\" with a factorial symbol (!) on top. She has four arms (because she's \"four\"!), each holding different tools: a speaking tube, a multiplication wrench, an order clipboard, and a celebration banner. Her vest is covered in badges showing \"4×3×2×1\" and she wears glasses shaped like multiplication signs. Her expression is eager and leadership-oriented—she starts the whole process! Her body is slightly squared (like the number 4) but bouncy and energetic. She's colored in bold ruby red with gold accents."
    },
    {
      "name": "Manager Three",
      "description": "A medium-height character with three ponytails that bounce when she moves, each ponytail decorated with a small gear. Her hard hat is shaped like the number \"3\" and glows softly. She has three eyes arranged in a triangle on her face (whimsical style—not creepy!), allowing her to watch three directions at once: above (Level 4), her own work, and below (Level 2). She wears a jumpsuit with three pockets and carries a three-pronged tool for managing her multiplication machine. Her body has gentle curves like the number 3. She's colored in emerald green with silver accents. She's focused and efficient, like a middle manager keeping the chain going."
    },
    {
      "name": "Manager Two",
      "description": "A character with a body shaped like two stacked circles (like a snowman but only two parts), making him literally look like the number \"2\". His hard hat has two antennae with small lights on top. He has two tools always in hand: a speaking horn and a multiplication calculator. His outfit is a two-tone uniform: half sapphire blue, half sky blue, split down the middle. He wears goggles with two lenses that can swivel independently. His expression is friendly and methodical—he knows he's close to the base case and maintains steady focus. He has two mechanical hands that can spin independently like gears."
    },
    {
      "name": "Manager One",
      "description": "A small but MIGHTY character who stands on a glowing pedestal, making her seem more important than her size suggests. She's shaped like the number \"1\"—tall, thin, and perfectly straight, but with a large round head and a big smile. She wears a golden crown-shaped hard hat with \"BASE CASE\" written on it. Unlike the other managers, she has a special glowing aura because she's the ONLY one who can answer without help. Her outfit is completely golden with amethyst purple accents. She carries a stamp that says \"1! = 1\" which she uses with great pride and authority. She has one big tool belt with one perfect tool. Her expression is confident and foundational—she KNOWS she's essential! Single antenna on her hat glows like a lighthouse."
    },
    {
      "name": "The Number Sprites",
      "description": "Small, floating helpers that carry the answers between levels. Each sprite looks like its number (a \"1\" sprite, a \"2\" sprite, a \"6\" sprite, and a \"24\" sprite), but with tiny wings, smiling faces, and sparkle trails. They're translucent and glow in their respective colors. The \"1\" sprite is tiny and golden. The \"2\" sprite is slightly bigger. The \"6\" sprite is medium-sized. The \"24\" sprite is the largest and most elaborate, covered in celebration sparkles. They don't speak but communicate through cheerful chimes and musical tones."
    },
    {
      "name": "The Calc-U-Trons",
      "description": "Each level has its own personality-filled multiplication machine (not quite characters, but animated and expressive). They have faces made of dials and displays, arms made of conveyor belts, and they light up and make happy whirring sounds when calculating. Each machine is decorated with its level's number and has a personality matching its manager—the Level 4 machine is enthusiastic and hasty, Level 3's is efficient and precise, Level 2's is steady and methodical, and Level 1's is simple but proud, with a sign that says \"NO MULTIPLICATION NEEDED - BASE CASE!\""
    },
    {
      "name": "Professor Factorial",
      "description": "A wise, elderly character with a beard shaped like a factorial symbol (!). Wears a top hat with the recursive formula \"n! = n × (n-1)!\" written around the brim. Has a pocket watch that runs backwards and forwards simultaneously. Carries a pointer shaped like an arrow (→) to show the flow of recursion. Dressed in a professorial coat covered in mathematical patches and medals. Has kind, twinkling eyes behind spiral-shaped spectacles. Sometimes appears at different levels, sometimes shows up in the margins—a guide who helps explain what's happening."
    }
  ],
  "elements": [
    {
      "name": "Multiplication Machine (Level 4)",
      "description": "A whimsical machine with personality, featuring dials, displays, conveyor belts for arms, and lights that glow when calculating. Makes happy whirring sounds during multiplication.",
      "category": "Machinery"
    },
    {
      "name": "Multiplication Machine (Level 3)",
      "description": "A whimsical machine with personality, featuring dials, displays, conveyor belts for arms, and lights that glow when calculating. Makes happy whirring sounds during multiplication.",
      "category": "Machinery"
    },
    {
      "name": "Multiplication Machine (Level 2)",
      "description": "A whimsical machine with personality, featuring dials, displays, conveyor belts for arms, and lights that glow when calculating. Makes happy whirring sounds during multiplication.",
      "category": "Machinery"
    },
    {
      "name": "Speaking Tube",
      "description": "A colorful communication tube that connects factory levels, used for passing questions downward during the recursive call process.",
      "category": "Machinery"
    },
    {
      "name": "Return Tube",
      "description": "A glowing tube that carries answers upward from lower levels, showing the return values flowing back up through the recursion.",
      "category": "Machinery"
    },
    {
      "name": "Conveyor Belt",
      "description": "A rainbow-colored segment conveyor belt that carries numbers and calculations between different parts of the factory floor.",
      "category": "Machinery"
    },
    {
      "name": "Factory Gears",
      "description": "Oversized gears labeled with numbers, spinning and turning as calculations proceed. Some are shaped like factorial symbols (!).",
      "category": "Machinery"
    },
    {
      "name": "Order Ticket",
      "description": "A floating pneumatic ticket showing the factorial calculation request (e.g., \"4!\"), delivered from above to start the process.",
      "category": "Props"
    },
    {
      "name": "Base Case Pedestal",
      "description": "A golden, glowing pedestal marking the foundation level where 1! = 1. Has special importance as the stopping point of recursion.",
      "category": "Set Pieces"
    },
    {
      "name": "Factory Level 4",
      "description": "The top factory floor representing recursion depth 4, where the initial request arrives.",
      "category": "Set Pieces"
    },
    {
      "name": "Factory Level 3",
      "description": "Factory floor representing recursion depth 3, one level down from the top.",
      "category": "Set Pieces"
    },
    {
      "name": "Factory Level 2",
      "description": "Factory floor representing recursion depth 2, two levels down from the top.",
      "category": "Set Pieces"
    },
    {
      "name": "Factory Level 1",
      "description": "The foundation factory floor representing recursion depth 1 - the base case level.",
      "category": "Set Pieces"
    }
  ],
  "scenes": [
    {
      "title": "The Order Arrives",
      "description": "The top floor of the Factorial Factory. A large \"4!\" order ticket floats down from a pneumatic tube into the hands of Manager Four. The room is bright and busy, with gears labeled \"4\" spinning slowly, waiting for their answer. A large multiplication board shows \"4 × ?\" with a question mark glowing. A speaking tube extends downward through the floor, and Manager Four is leaning over it, calling down to Level 3. The atmosphere is one of anticipation—work has just begun!",
      "characters": [
        "Manager Four"
      ],
      "elements": [
        "Speaking Tube",
        "Factory Gears",
        "Order Ticket"
      ],
      "textPanel": "The order comes in: \"Calculate four!\"\nThe manager says, \"I can't do this alone, that's for sure!\nFour-factorial means four times three-factorial, you see,\nSo I'll call the next floor down and wait patiently!\""
    },
    {
      "title": "Level 3 Springs to Life",
      "description": "Level 3 of the factory, positioned one floor below Level 4. Manager Three is catching the message coming up through a speaking tube from below, while simultaneously listening to a speaking tube from Level 4 above. The room is decorated with gears showing \"3\" and multiplication tables on the walls. A conveyor belt labeled \"3 × ?\" waits to move. Manager Three is pointing downward to Level 2, ready to pass along her own question. The space shows the middle of the recursive chain—receiving from above, delegating below.",
      "characters": [
        "Manager Three"
      ],
      "elements": [
        "Speaking Tube",
        "Conveyor Belt",
        "Factory Gears",
        "Factory Level 3"
      ],
      "textPanel": "Down on Level Three, a new manager appears,\n\"Calculate three-factorial!\" rings in her ears.\nBut three times two-factorial is what she must find,\nSo she calls Level Two—another floor to unwind!"
    },
    {
      "title": "Level 2 Gets to Work",
      "description": "Level 2 of the factory, two floors below the top. Manager Two is at his workstation, which features prominent gears labeled \"2\" and a multiplication machine showing \"2 × ?\". He's speaking into a tube that descends to Level 1. The room has two speaking tubes—one coming from Level 3 above, one going to Level 1 below. Conveyor belts are paused, waiting for the answer from below. The factory machinery is elaborate but patient, showing how each level depends on the next.",
      "characters": [
        "Manager Two"
      ],
      "elements": [
        "Multiplication Machine (Level 2)",
        "Speaking Tube",
        "Conveyor Belt",
        "Factory Gears",
        "Factory Level 2"
      ],
      "textPanel": "Level Two springs to life with a whirr and a clank,\nThe manager says, \"Two-factorial? I need a lower rank!\"\n\"Two times one-factorial,\" he carefully states,\nAnd calls Level One while his answer awaits!"
    },
    {
      "title": "Level 1 Ready to Solve",
      "description": "Level 1 of the factory—the deepest floor with a special golden glow. Manager One is at her station, which is simpler but more important than the others. A large sign reads \"BASE CASE - 1! = 1\" in glowing letters. Unlike other levels, this floor has NO speaking tube going downward—this is where the recursion stops! The machinery here is ready to produce the answer immediately. The room has a foundational feeling, like the bedrock of the factory.",
      "characters": [
        "Manager One"
      ],
      "elements": [
        "Speaking Tube",
        "Base Case Pedestal",
        "Factory Level 1"
      ],
      "textPanel": "Down at Level One, the call comes through clear,\n\"We need one-factorial!\" the message appears.\nThe manager grins—this is easy to do,\n\"One-factorial equals one—that's always true!\""
    },
    {
      "title": "The Base Case Celebration",
      "description": "Still on Level 1, but now Manager One is celebrating! She's holding up a glowing number \"1\" that she's just created. Sparkles of \"completion dust\" fill the air. The machinery around her is lit up with success lights. She's putting the number \"1\" into an \"ANSWER RETURN\" tube that will send it upward to Level 2. This is the turning point—the only level that can answer without help. The mood is triumphant and foundational.",
      "characters": [
        "Manager One"
      ],
      "elements": [],
      "textPanel": "\"I don't need to call anyone else!\" she exclaims with delight,\n\"One-factorial is one—I can answer outright!\"\nThe base case is reached, the foundation is laid,\nAnd now the answers flow back—the calls will be repaid!"
    },
    {
      "title": "Level 2 Multiplies",
      "description": "Back on Level 2. The number \"1\" has just arrived via the return tube from Level 1 below. Manager Two is at his multiplication machine, placing the \"1\" next to a \"2\" on the conveyor belt. The machine shows \"2 × 1 = 2\" in glowing numbers. The gears are turning actively now, and a new glowing \"2\" is being created. Manager Two is preparing to send this \"2\" up to Level 3 through the upward return tube. The atmosphere shows progress and momentum building.",
      "characters": [
        "Manager Two"
      ],
      "elements": [
        "Multiplication Machine (Level 2)",
        "Return Tube",
        "Conveyor Belt",
        "Factory Gears",
        "Factory Level 2"
      ],
      "textPanel": "The answer \"ONE\" travels up to Level Two,\nThe manager multiplies: \"Two times one—I'm through!\"\n\"Two-factorial equals TWO!\" he announces with pride,\nAnd sends this result to Level Three, up the side!"
    },
    {
      "title": "Level 3 Gets Her Answer",
      "description": "Level 3 is now active and calculating. Manager Three has received the glowing \"2\" from below and is running it through her multiplication machine. The display shows \"3 × 2 = 6\" in bright, cheerful numbers. A large glowing \"6\" is being produced on her conveyor belt. She's excitedly preparing to send this result upward to Level 4 through the return tube. The factory machinery is whirring with purpose. The recursive chain is nearly complete!",
      "characters": [
        "Manager Three"
      ],
      "elements": [
        "Multiplication Machine (Level 3)",
        "Return Tube",
        "Conveyor Belt",
        "Factory Level 3"
      ],
      "textPanel": "Level Three receives \"TWO\" with a cheerful chime,\nThe manager calculates: \"Three times two—it's time!\"\n\"Three-factorial equals SIX!\" she declares with glee,\nAnd shoots the answer upward to Level Four, you see!"
    },
    {
      "title": "Level 4 - The Final Answer!",
      "description": "The top floor again—but now it's a celebration! Manager Four has received the glowing \"6\" from Level 3 below. His multiplication machine shows \"4 × 6 = 24\" in brilliant, sparkling numbers. A huge glowing \"24\" sits on the completion platform. Factory lights are flashing with success, confetti of numbers falls from the ceiling, and the original order ticket now reads \"4! = 24 ✓ COMPLETE!\" Manager Four is triumphantly holding up the final answer. All four levels can be glimpsed in the background, connected by glowing tubes showing how the answer traveled back up.",
      "characters": [
        "Manager Four"
      ],
      "elements": [
        "Multiplication Machine (Level 4)",
        "Order Ticket",
        "Factory Level 4"
      ],
      "textPanel": "The top floor receives \"SIX\"—the wait is done!\nThe manager multiplies: \"Four times six—we've won!\"\n\"Four-factorial equals TWENTY-FOUR!\" rings through the air,\nThe order's complete! Success everywhere!"
    },
    {
      "title": "The Complete Factory View",
      "description": "A cutaway view showing all four levels of the Factorial Factory simultaneously. Level 4 at the top (with \"24\"), Level 3 below it (with \"6\"), Level 2 below that (with \"2\"), and Level 1 at the bottom (with \"1\"). Glowing arrows show the path DOWN through the levels (4→3→2→1) and then back UP with answers (1→2→6→24). All four managers are visible at their stations, connected by speaking tubes and return tubes. The scene illustrates the complete recursive journey—down to the base case, then back up with solutions. It's a celebration of how all the pieces work together!",
      "characters": [],
      "elements": [
        "Speaking Tube",
        "Return Tube",
        "Base Case Pedestal"
      ],
      "textPanel": "And that's how recursion works in our factory grand,\nEach level calls down, then waits with answer in hand.\nBreak big problems to small, till the base case is found,\nThen build up the solution as answers rebound!\n\nFrom four down to one, then one back to twenty-four,\nEach manager played their part in this elegant chore.\nSo remember, dear students, when problems seem tall:\nJust break them in pieces—recursion solves all!"
    }
  ]
}